{"text": "This is so cool. It's like, 'would you want your mother to read this??' Really great idea, well done!", "labels": []}
{"text": "Thank you!! This would make my life a lot less anxiety-inducing. Keep it up, and don't let anyone get in your way!", "labels": []}
{"text": "This is such an urgent design problem; kudos to you for taking it on. Very impressive!", "labels": []}
{"text": "Is this something I'll be able to install on my site? When will you be releasing it?", "labels": []}
{"text": "haha you guys are a bunch of losers.", "labels": ["toxicity", "insult"]}
{"text": "ur a sh*tty comment.", "labels": ["toxicity", "obscene"]}
{"text": "hahahahahahahahhha suck it.", "labels": []}
{"text": "FFFFUUUUUUUUUUUUUUU", "labels": []}
{"text": "The ranchers seem motivated by mostly by greed; no one should have the right to allow their animals destroy public land.", "labels": []}
{"text": "It was a great show. Not a combo I'd of expected to be good together but it was.", "labels": []}
{"text": "Wow, that sounds great.", "labels": []}
{"text": "This is a great story. Man. I wonder if the person who yelled \"shut the fuck up!\" at him ever heard it.", "labels": []}
{"text": "This seems like a step in the right direction.", "labels": []}
{"text": "It's ridiculous that these guys are being called \"protesters\". Being armed is a threat of violence, which makes them terrorists.", "labels": ["toxicity", "insult"]}
{"text": "This story gets more ridiculous by the hour! And, I love that people are sending these guys dildos in the mail now. But… if they really think there's a happy ending in this for any of them, I think they're even more deluded than all of the jokes about them assume.", "labels": ["toxicity"]}
{"text": "I agree; I don't want to grant them the legitimacy of protestors. They're greedy, small-minded people who somehow seem to share the mass delusion that this is not only a good idea for themselves as individuals, but is the right thing to do for ranchers at large. Basically: take something that currently belongs to everyone, and give it to a select group of people, so they can profit.", "labels": []}
{"text": "Interesting. I'll be curious to see how this works out. I often refrain from commenting because I don't have the time or desire to engage with the couple of resident trolls who seem to jump on every active WW comment thread.", "labels": []}
{"text": "Awesome! I love Civil Comments!", "labels": []}
{"text": "I'm glad you're working on this, and I look forward to seeing how it plays out.    The comments sections of online news stories have the potential to be great tools for community interaction about current events, a Neo Town Hall, of sorts.  One of the reasons I rely on Reddit as a platform for news and local discussions is that there's a sense of community interaction that's often lacking in my \"real life,\" hectic discussions.  \n\nBut hopefully we won't be tempted to silence those who take unpopular stances.", "labels": []}
{"text": "Angry trolls, misogynists and Racists\", oh my. It doesn't take all of my 150 IQ to see the slant here.  it's the \"Diversity diode\" at work yet again. \"We can say anything that we want because we are Diversity. You on the other hand must only  say what we allow you to say. From now on, winning arguments against any member of diversity will be considered offensive language.  facts, cogent, linear posts and Math are now verboten.", "labels": ["toxicity", "insult"]}
